_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 226, 226, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 112, 112, 32)      128       
_________________________________________________________________
conv1_relu (Activation)      (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pad_1 (ZeroPadding2D)   (None, 114, 114, 32)      0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128       
_________________________________________________________________
conv_dw_1_relu (Activation)  (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256       
_________________________________________________________________
conv_pw_1_relu (Activation)  (None, 112, 112, 64)      0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 114, 114, 64)      0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256       
_________________________________________________________________
conv_dw_2_relu (Activation)  (None, 56, 56, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_2_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_3 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_dw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512       
_________________________________________________________________
conv_dw_4_relu (Activation)  (None, 28, 28, 128)       0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_4_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_5 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_dw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024      
_________________________________________________________________
conv_dw_6_relu (Activation)  (None, 14, 14, 256)       0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_6_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_7 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_8 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_9 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_10 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_11 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (Activation) (None, 7, 7, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pad_13 (ZeroPadding2D)  (None, 9, 9, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 4100      
=================================================================
Total params: 4,282,564
Trainable params: 4,260,676
Non-trainable params: 21,888
_________________________________________________________________
<keras.engine.input_layer.InputLayer object at 0x7f836627a750> False
<keras.layers.convolutional.ZeroPadding2D object at 0x7f836627a9d0> True
<keras.layers.convolutional.Conv2D object at 0x7f836627aa50> True
<keras.layers.normalization.BatchNormalization object at 0x7f836627aa90> True
<keras.layers.core.Activation object at 0x7f836627abd0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f8366220110> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f8366220650> True
<keras.layers.normalization.BatchNormalization object at 0x7f8365ff87d0> True
<keras.layers.core.Activation object at 0x7f8365fede50> True
<keras.layers.convolutional.Conv2D object at 0x7f834c16a490> True
<keras.layers.normalization.BatchNormalization object at 0x7f834c16a890> True
<keras.layers.core.Activation object at 0x7f834c145d10> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f834c0db150> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f834c11cc10> True
<keras.layers.normalization.BatchNormalization object at 0x7f834c0a27d0> True
<keras.layers.core.Activation object at 0x7f834c06fd50> True
<keras.layers.convolutional.Conv2D object at 0x7f833c43ccd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f834c078350> True
<keras.layers.core.Activation object at 0x7f834c0327d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f8328649c50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f833c46b950> True
<keras.layers.normalization.BatchNormalization object at 0x7f83286ab390> True
<keras.layers.core.Activation object at 0x7f833c46b8d0> True
<keras.layers.convolutional.Conv2D object at 0x7f832867acd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f832867a950> True
<keras.layers.core.Activation object at 0x7f83286358d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f8328483fd0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f8328483dd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f83284b9990> True
<keras.layers.core.Activation object at 0x7f83284aef90> True
<keras.layers.convolutional.Conv2D object at 0x7f832830b4d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f832830b8d0> True
<keras.layers.core.Activation object at 0x7f83282c6150> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f8328294ed0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f83282940d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f832814d450> True
<keras.layers.core.Activation object at 0x7f8328141c10> True
<keras.layers.convolutional.Conv2D object at 0x7f8328118c50> True
<keras.layers.normalization.BatchNormalization object at 0x7f83281188d0> True
<keras.layers.core.Activation object at 0x7f83280d1890> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f83280a0f90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f83280a0d90> True
<keras.layers.normalization.BatchNormalization object at 0x7f8328057950> True
<keras.layers.core.Activation object at 0x7f832804cfd0> True
<keras.layers.convolutional.Conv2D object at 0x7f832802d490> True
<keras.layers.normalization.BatchNormalization object at 0x7f832802d890> True
<keras.layers.core.Activation object at 0x7f8313de4110> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f8313db4e90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f8313db4090> True
<keras.layers.normalization.BatchNormalization object at 0x7f8313c6c250> True
<keras.layers.core.Activation object at 0x7f8313c60bd0> True
<keras.layers.convolutional.Conv2D object at 0x7f8313c39c10> True
<keras.layers.normalization.BatchNormalization object at 0x7f8313c39890> True
<keras.layers.core.Activation object at 0x7f8313bf4850> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f8313a40f50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f8313a40d50> True
<keras.layers.normalization.BatchNormalization object at 0x7f8313a77910> True
<keras.layers.core.Activation object at 0x7f8313a6cf90> True
<keras.layers.convolutional.Conv2D object at 0x7f83138cd450> True
<keras.layers.normalization.BatchNormalization object at 0x7f83138cd850> True
<keras.layers.core.Activation object at 0x7f8313887090> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f8313753e50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f8313753050> True
<keras.layers.normalization.BatchNormalization object at 0x7f831370c210> True
<keras.layers.core.Activation object at 0x7f8313701b90> True
<keras.layers.convolutional.Conv2D object at 0x7f83136dcbd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f83136dc850> True
<keras.layers.core.Activation object at 0x7f8313693810> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f8313563e10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f8313563810> True
<keras.layers.normalization.BatchNormalization object at 0x7f83135198d0> True
<keras.layers.core.Activation object at 0x7f8313510f50> True
<keras.layers.convolutional.Conv2D object at 0x7f83134edf90> True
<keras.layers.normalization.BatchNormalization object at 0x7f83134ed0d0> True
<keras.layers.core.Activation object at 0x7f8313346e90> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f831335a510> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f831339dc50> True
<keras.layers.normalization.BatchNormalization object at 0x7f831332d450> True
<keras.layers.core.Activation object at 0x7f8313323a50> True
<keras.layers.convolutional.Conv2D object at 0x7f83131fbcd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f83131fb710> True
<keras.layers.core.Activation object at 0x7f83131b4a50> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f8313004c10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f8313004610> True
<keras.layers.normalization.BatchNormalization object at 0x7f831303cb10> True
<keras.layers.core.Activation object at 0x7f8313032e10> True
<keras.layers.convolutional.Conv2D object at 0x7f8312e93090> True
<keras.layers.normalization.BatchNormalization object at 0x7f8312e8bd90> True
<keras.layers.core.Activation object at 0x7f8312e425d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f8312e31850> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f8312e1e1d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f8312ccc250> True
<keras.layers.core.Activation object at 0x7f8312e1e2d0> True
<keras.layers.convolutional.Conv2D object at 0x7f8312ca3ed0> True
<keras.layers.normalization.BatchNormalization object at 0x7f8312ca3910> True
<keras.layers.core.Activation object at 0x7f8312c5ca90> True
<keras.layers.pooling.GlobalAveragePooling2D object at 0x7f8312ae2e50> True
<keras.layers.core.Dense object at 0x7f83116b1f90> True
<keras.layers.core.Dense object at 0x7f83116c65d0> True
saved model name:  /home/advrobot/ev_safety_check/models/4labels_AndewNDataClassfied_1024dense.h5
Found 77721 images belonging to 4 classes.
Found 22257 images belonging to 4 classes.
train_label2index =  {'car': 0, 'nopeople': 3, 'manypeople': 2, 'fewpeople': 1}
label2index =  {'car': 0, 'nopeople': 3, 'manypeople': 2, 'fewpeople': 1}
start training time =  2018-08-11 15:31:39.572388
Epoch 1/20
 - 2667s - loss: 0.0118 - acc: 0.9963 - val_loss: 3.6053e-04 - val_acc: 0.9999
Epoch 2/20
 - 2698s - loss: 0.0021 - acc: 0.9996 - val_loss: 2.8745e-05 - val_acc: 1.0000
Epoch 3/20
 - 2696s - loss: 6.4367e-04 - acc: 0.9999 - val_loss: 3.7240e-05 - val_acc: 1.0000
Epoch 4/20
 - 2695s - loss: 6.3059e-04 - acc: 0.9999 - val_loss: 6.5542e-06 - val_acc: 1.0000
Epoch 5/20
 - 2697s - loss: 0.0025 - acc: 0.9997 - val_loss: 1.6210e-07 - val_acc: 1.0000
Epoch 6/20
 - 2696s - loss: 1.2189e-04 - acc: 1.0000 - val_loss: 2.8061e-07 - val_acc: 1.0000
Epoch 7/20
 - 2695s - loss: 3.9426e-04 - acc: 0.9999 - val_loss: 3.5089e-04 - val_acc: 1.0000
Epoch 8/20
 - 2697s - loss: 0.0021 - acc: 0.9997 - val_loss: 5.9427e-04 - val_acc: 1.0000
Epoch 9/20
 - 2695s - loss: 8.5453e-06 - acc: 1.0000 - val_loss: 8.3094e-05 - val_acc: 1.0000
Epoch 10/20
 - 2696s - loss: 8.7216e-05 - acc: 1.0000 - val_loss: 2.7324e-04 - val_acc: 1.0000
Epoch 11/20
 - 2697s - loss: 5.7939e-04 - acc: 0.9997 - val_loss: 2.1148e-04 - val_acc: 1.0000
Epoch 12/20
 - 2698s - loss: 5.4086e-05 - acc: 1.0000 - val_loss: 1.2811e-04 - val_acc: 1.0000
Epoch 13/20
 - 2696s - loss: 0.0011 - acc: 0.9997 - val_loss: 5.1252e-05 - val_acc: 1.0000
Epoch 14/20
 - 2696s - loss: 1.4107e-05 - acc: 1.0000 - val_loss: 1.2047e-07 - val_acc: 1.0000
Epoch 15/20
 - 2696s - loss: 9.8974e-07 - acc: 1.0000 - val_loss: 1.2062e-07 - val_acc: 1.0000
Epoch 16/20
 - 2697s - loss: 2.2861e-07 - acc: 1.0000 - val_loss: 1.2783e-07 - val_acc: 1.0000
Epoch 17/20
 - 2697s - loss: 1.8623e-04 - acc: 0.9997 - val_loss: 1.7897e-07 - val_acc: 1.0000
Epoch 18/20
 - 2696s - loss: 3.5340e-06 - acc: 1.0000 - val_loss: 1.7849e-07 - val_acc: 1.0000
Epoch 19/20
 - 2698s - loss: 1.3957e-04 - acc: 1.0000 - val_loss: 8.0803e-07 - val_acc: 1.0000
Epoch 20/20
 - 2696s - loss: 0.0015 - acc: 0.9997 - val_loss: 5.7819e-05 - val_acc: 1.0000
end training time =  2018-08-12 06:30:04.775312
Found 22257 images belonging to 4 classes.
No of errors = 1/22257
