_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 226, 226, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 112, 112, 32)      128       
_________________________________________________________________
conv1_relu (Activation)      (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pad_1 (ZeroPadding2D)   (None, 114, 114, 32)      0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128       
_________________________________________________________________
conv_dw_1_relu (Activation)  (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256       
_________________________________________________________________
conv_pw_1_relu (Activation)  (None, 112, 112, 64)      0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 114, 114, 64)      0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256       
_________________________________________________________________
conv_dw_2_relu (Activation)  (None, 56, 56, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_2_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_3 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_dw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512       
_________________________________________________________________
conv_dw_4_relu (Activation)  (None, 28, 28, 128)       0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_4_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_5 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_dw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024      
_________________________________________________________________
conv_dw_6_relu (Activation)  (None, 14, 14, 256)       0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_6_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_7 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_8 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_9 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_10 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_11 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (Activation) (None, 7, 7, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pad_13 (ZeroPadding2D)  (None, 9, 9, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               262400    
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 1028      
=================================================================
Total params: 3,492,292
Trainable params: 3,470,404
Non-trainable params: 21,888
_________________________________________________________________
<keras.engine.input_layer.InputLayer object at 0x7f40524408d0> False
<keras.layers.convolutional.ZeroPadding2D object at 0x7f4052440c10> True
<keras.layers.convolutional.Conv2D object at 0x7f4052440c50> True
<keras.layers.normalization.BatchNormalization object at 0x7f4052440c90> True
<keras.layers.core.Activation object at 0x7f4052440dd0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f40500400d0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f40521cd190> True
<keras.layers.normalization.BatchNormalization object at 0x7f4052194f10> True
<keras.layers.core.Activation object at 0x7f40521cd150> True
<keras.layers.convolutional.Conv2D object at 0x7f405006a710> True
<keras.layers.normalization.BatchNormalization object at 0x7f4052487dd0> True
<keras.layers.core.Activation object at 0x7f403c09a410> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f403c07eed0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f403c07e710> True
<keras.layers.normalization.BatchNormalization object at 0x7f403c018390> True
<keras.layers.core.Activation object at 0x7f403c07edd0> True
<keras.layers.convolutional.Conv2D object at 0x7f40241ddf50> True
<keras.layers.normalization.BatchNormalization object at 0x7f40241dd250> True
<keras.layers.core.Activation object at 0x7f402417df50> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f4024158e50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f4024158f90> True
<keras.layers.normalization.BatchNormalization object at 0x7f40240f6dd0> True
<keras.layers.core.Activation object at 0x7f4024158b10> True
<keras.layers.convolutional.Conv2D object at 0x7f40240ded50> True
<keras.layers.normalization.BatchNormalization object at 0x7f40240dea10> True
<keras.layers.core.Activation object at 0x7f402407b350> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f4024049490> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f4024059950> True
<keras.layers.normalization.BatchNormalization object at 0x7f40115c93d0> True
<keras.layers.core.Activation object at 0x7f40240599d0> True
<keras.layers.convolutional.Conv2D object at 0x7f40115a5510> True
<keras.layers.normalization.BatchNormalization object at 0x7f40115a5ad0> True
<keras.layers.core.Activation object at 0x7f4011546410> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f4011521b10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f4011521850> True
<keras.layers.normalization.BatchNormalization object at 0x7f40114c2150> True
<keras.layers.core.Activation object at 0x7f4011521b90> True
<keras.layers.convolutional.Conv2D object at 0x7f40114af890> True
<keras.layers.normalization.BatchNormalization object at 0x7f40114af550> True
<keras.layers.core.Activation object at 0x7f40114b9fd0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f4011411e90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f4011411fd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f4011433710> True
<keras.layers.core.Activation object at 0x7f4011411c10> True
<keras.layers.convolutional.Conv2D object at 0x7f401139ee10> True
<keras.layers.normalization.BatchNormalization object at 0x7f401139ead0> True
<keras.layers.core.Activation object at 0x7f40113bb3d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f4011301c50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f4011312a50> True
<keras.layers.normalization.BatchNormalization object at 0x7f4011331490> True
<keras.layers.core.Activation object at 0x7f4011312ad0> True
<keras.layers.convolutional.Conv2D object at 0x7f401128d5d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f401128db90> True
<keras.layers.core.Activation object at 0x7f40112b21d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f401120dc50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f401120dbd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f401122c210> True
<keras.layers.core.Activation object at 0x7f401120d750> True
<keras.layers.convolutional.Conv2D object at 0x7f4011193950> True
<keras.layers.normalization.BatchNormalization object at 0x7f4011193610> True
<keras.layers.core.Activation object at 0x7f40111bced0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f401117fcd0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f401117f250> True
<keras.layers.normalization.BatchNormalization object at 0x7f401111f7d0> True
<keras.layers.core.Activation object at 0x7f401110e890> True
<keras.layers.convolutional.Conv2D object at 0x7f401108be50> True
<keras.layers.normalization.BatchNormalization object at 0x7f401108bb90> True
<keras.layers.core.Activation object at 0x7f40110a8490> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f4011070d10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f4011004b10> True
<keras.layers.normalization.BatchNormalization object at 0x7f401101f550> True
<keras.layers.core.Activation object at 0x7f4011004b90> True
<keras.layers.convolutional.Conv2D object at 0x7f4010fffc50> True
<keras.layers.normalization.BatchNormalization object at 0x7f4010fffbd0> True
<keras.layers.core.Activation object at 0x7f4010f9ee10> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f4010f7aad0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f4010f7aa90> True
<keras.layers.normalization.BatchNormalization object at 0x7f4010f19dd0> True
<keras.layers.core.Activation object at 0x7f4010f7a6d0> True
<keras.layers.convolutional.Conv2D object at 0x7f4010ef8190> True
<keras.layers.normalization.BatchNormalization object at 0x7f4010e8a490> True
<keras.layers.core.Activation object at 0x7f4010e96390> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f4010e6fe90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f4010e6fe50> True
<keras.layers.normalization.BatchNormalization object at 0x7f4010e10dd0> True
<keras.layers.core.Activation object at 0x7f4010e6fa90> True
<keras.layers.convolutional.Conv2D object at 0x7f4010da6d90> True
<keras.layers.normalization.BatchNormalization object at 0x7f4010dfe950> True
<keras.layers.core.Activation object at 0x7f4010d99150> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f4010cd09d0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f4010d653d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f4010d150d0> True
<keras.layers.core.Activation object at 0x7f4010d77ed0> True
<keras.layers.convolutional.Conv2D object at 0x7f4010cf26d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f4010cf2bd0> True
<keras.layers.core.Activation object at 0x7f4010c92dd0> True
<keras.layers.pooling.GlobalAveragePooling2D object at 0x7f4010c0cd50> True
<keras.layers.core.Dense object at 0x7f401006b0d0> True
<keras.layers.core.Dense object at 0x7f4010b8e0d0> True
saved model name:  /home/jimmy/catkin_ws/src/ev_safety_check/models/4labels_AndrewNDatatClassified_dense256.h5
Found 77721 images belonging to 4 classes.
Found 22257 images belonging to 4 classes.
train_label2index =  {'car': 0, 'nopeople': 3, 'manypeople': 2, 'fewpeople': 1}
label2index =  {'car': 0, 'nopeople': 3, 'manypeople': 2, 'fewpeople': 1}
start training time =  2018-08-13 09:04:58.981840
Epoch 1/20
 - 2764s - loss: 0.0097 - acc: 0.9971 - val_loss: 6.8343e-04 - val_acc: 0.9999
Epoch 2/20
 - 2765s - loss: 0.0013 - acc: 0.9995 - val_loss: 1.3466e-05 - val_acc: 1.0000
Epoch 3/20
 - 2712s - loss: 0.0021 - acc: 0.9997 - val_loss: 2.4545e-07 - val_acc: 1.0000
Epoch 4/20
 - 2695s - loss: 5.0908e-05 - acc: 1.0000 - val_loss: 3.1382e-05 - val_acc: 1.0000
Epoch 5/20
 - 2675s - loss: 7.2298e-04 - acc: 0.9997 - val_loss: 6.4486e-07 - val_acc: 1.0000
Epoch 6/20
 - 2721s - loss: 2.6448e-04 - acc: 1.0000 - val_loss: 1.3224e-07 - val_acc: 1.0000
Epoch 7/20
 - 2770s - loss: 3.3194e-04 - acc: 0.9997 - val_loss: 1.1964e-07 - val_acc: 1.0000
Epoch 8/20
 - 2777s - loss: 2.5152e-06 - acc: 1.0000 - val_loss: 1.6356e-07 - val_acc: 1.0000
Epoch 9/20
 - 2792s - loss: 2.4094e-04 - acc: 0.9997 - val_loss: 2.4041e-04 - val_acc: 0.9999
Epoch 10/20
 - 2865s - loss: 2.2061e-04 - acc: 1.0000 - val_loss: 1.1924e-07 - val_acc: 1.0000
Epoch 11/20
 - 2731s - loss: 6.3451e-05 - acc: 1.0000 - val_loss: 1.1923e-07 - val_acc: 1.0000
Epoch 12/20
 - 2740s - loss: 1.1607e-04 - acc: 1.0000 - val_loss: 7.3086e-05 - val_acc: 1.0000
Epoch 13/20
 - 2883s - loss: 7.1371e-05 - acc: 1.0000 - val_loss: 1.5128e-07 - val_acc: 1.0000
Epoch 14/20
 - 2894s - loss: 2.9051e-05 - acc: 1.0000 - val_loss: 1.4486e-07 - val_acc: 1.0000
Epoch 15/20
 - 2896s - loss: 2.2260e-05 - acc: 1.0000 - val_loss: 1.1931e-07 - val_acc: 1.0000
Epoch 16/20
 - 2895s - loss: 1.8225e-05 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 17/20
 - 2895s - loss: 1.5241e-07 - acc: 1.0000 - val_loss: 1.1923e-07 - val_acc: 1.0000
Epoch 18/20
 - 2895s - loss: 4.2413e-04 - acc: 0.9997 - val_loss: 1.1957e-07 - val_acc: 1.0000
Epoch 19/20
 - 2894s - loss: 1.6592e-04 - acc: 1.0000 - val_loss: 1.1981e-07 - val_acc: 1.0000
Epoch 20/20
 - 2895s - loss: 5.2325e-07 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
end training time =  2018-08-14 00:40:56.652843
Found 22257 images belonging to 4 classes.
No of errors = 1/22257
