_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 226, 226, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 112, 112, 32)      128       
_________________________________________________________________
conv1_relu (Activation)      (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pad_1 (ZeroPadding2D)   (None, 114, 114, 32)      0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128       
_________________________________________________________________
conv_dw_1_relu (Activation)  (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256       
_________________________________________________________________
conv_pw_1_relu (Activation)  (None, 112, 112, 64)      0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 114, 114, 64)      0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256       
_________________________________________________________________
conv_dw_2_relu (Activation)  (None, 56, 56, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_2_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_3 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_dw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_3_relu (Activation)  (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 58, 58, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512       
_________________________________________________________________
conv_dw_4_relu (Activation)  (None, 28, 28, 128)       0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_4_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_5 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_dw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_5_relu (Activation)  (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024      
_________________________________________________________________
conv_dw_6_relu (Activation)  (None, 14, 14, 256)       0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_6_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_7 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_7_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_8 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_8_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_9 (ZeroPadding2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_9_relu (Activation)  (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_10 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_10_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_11 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_11_relu (Activation) (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 16, 16, 512)       0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (Activation) (None, 7, 7, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pad_13 (ZeroPadding2D)  (None, 9, 9, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (Activation) (None, 7, 7, 1024)        0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               524800    
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 2052      
=================================================================
Total params: 3,755,716
Trainable params: 3,733,828
Non-trainable params: 21,888
_________________________________________________________________
<keras.engine.input_layer.InputLayer object at 0x7f26136408d0> False
<keras.layers.convolutional.ZeroPadding2D object at 0x7f2613640c10> True
<keras.layers.convolutional.Conv2D object at 0x7f2613640c50> True
<keras.layers.normalization.BatchNormalization object at 0x7f2613640c90> True
<keras.layers.core.Activation object at 0x7f2613640dd0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f261003e0d0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f26133cd190> True
<keras.layers.normalization.BatchNormalization object at 0x7f2613394f10> True
<keras.layers.core.Activation object at 0x7f26133cd150> True
<keras.layers.convolutional.Conv2D object at 0x7f2610068710> True
<keras.layers.normalization.BatchNormalization object at 0x7f2613687dd0> True
<keras.layers.core.Activation object at 0x7f25eef33410> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25eef17ed0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25eef17710> True
<keras.layers.normalization.BatchNormalization object at 0x7f25ec0e8390> True
<keras.layers.core.Activation object at 0x7f25eef17dd0> True
<keras.layers.convolutional.Conv2D object at 0x7f25ec0c6f50> True
<keras.layers.normalization.BatchNormalization object at 0x7f25ec0c6250> True
<keras.layers.core.Activation object at 0x7f25ec066f10> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25ec041e50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25ec041f90> True
<keras.layers.normalization.BatchNormalization object at 0x7f25e448ddd0> True
<keras.layers.core.Activation object at 0x7f25ec041b10> True
<keras.layers.convolutional.Conv2D object at 0x7f25e4475d50> True
<keras.layers.normalization.BatchNormalization object at 0x7f25e4475a10> True
<keras.layers.core.Activation object at 0x7f25e4412350> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25e41dc490> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25e41ec950> True
<keras.layers.normalization.BatchNormalization object at 0x7f25e41893d0> True
<keras.layers.core.Activation object at 0x7f25e41ec9d0> True
<keras.layers.convolutional.Conv2D object at 0x7f25e4165510> True
<keras.layers.normalization.BatchNormalization object at 0x7f25e4165ad0> True
<keras.layers.core.Activation object at 0x7f25e4106410> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25e40e1b10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25e40e1850> True
<keras.layers.normalization.BatchNormalization object at 0x7f25e4082150> True
<keras.layers.core.Activation object at 0x7f25e40e1b90> True
<keras.layers.convolutional.Conv2D object at 0x7f25e406f890> True
<keras.layers.normalization.BatchNormalization object at 0x7f25e406f550> True
<keras.layers.core.Activation object at 0x7f25e4079f90> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25defcfe90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25defcffd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f25deff1710> True
<keras.layers.core.Activation object at 0x7f25defcfc10> True
<keras.layers.convolutional.Conv2D object at 0x7f25def5ce10> True
<keras.layers.normalization.BatchNormalization object at 0x7f25def5cad0> True
<keras.layers.core.Activation object at 0x7f25def793d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25deebfc50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25deed0a50> True
<keras.layers.normalization.BatchNormalization object at 0x7f25deeef490> True
<keras.layers.core.Activation object at 0x7f25deed0ad0> True
<keras.layers.convolutional.Conv2D object at 0x7f25dee4b5d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f25dee4bb90> True
<keras.layers.core.Activation object at 0x7f25dee701d0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25dedcbc50> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25dedcbbd0> True
<keras.layers.normalization.BatchNormalization object at 0x7f25dedea210> True
<keras.layers.core.Activation object at 0x7f25dedcb750> True
<keras.layers.convolutional.Conv2D object at 0x7f25ded51950> True
<keras.layers.normalization.BatchNormalization object at 0x7f25ded51610> True
<keras.layers.core.Activation object at 0x7f25ded7aed0> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25ded3dcd0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25ded3d250> True
<keras.layers.normalization.BatchNormalization object at 0x7f25decdd7d0> True
<keras.layers.core.Activation object at 0x7f25deccc890> True
<keras.layers.convolutional.Conv2D object at 0x7f25dec49e50> True
<keras.layers.normalization.BatchNormalization object at 0x7f25dec49b90> True
<keras.layers.core.Activation object at 0x7f25dec66490> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25dec2ed10> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25debc2b10> True
<keras.layers.normalization.BatchNormalization object at 0x7f25debdd550> True
<keras.layers.core.Activation object at 0x7f25debc2b90> True
<keras.layers.convolutional.Conv2D object at 0x7f25debbdc50> True
<keras.layers.normalization.BatchNormalization object at 0x7f25debbdbd0> True
<keras.layers.core.Activation object at 0x7f25deb5ce10> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25deb38ad0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25deb38a90> True
<keras.layers.normalization.BatchNormalization object at 0x7f25dead7dd0> True
<keras.layers.core.Activation object at 0x7f25deb386d0> True
<keras.layers.convolutional.Conv2D object at 0x7f25deab6190> True
<keras.layers.normalization.BatchNormalization object at 0x7f25dea48490> True
<keras.layers.core.Activation object at 0x7f25dea54390> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25dea2de90> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25dea2de50> True
<keras.layers.normalization.BatchNormalization object at 0x7f25de9cedd0> True
<keras.layers.core.Activation object at 0x7f25dea2da90> True
<keras.layers.convolutional.Conv2D object at 0x7f25de964d90> True
<keras.layers.normalization.BatchNormalization object at 0x7f25de9bc950> True
<keras.layers.core.Activation object at 0x7f25de957150> True
<keras.layers.convolutional.ZeroPadding2D object at 0x7f25de88e9d0> True
<keras.layers.convolutional.DepthwiseConv2D object at 0x7f25de9233d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f25de8d30d0> True
<keras.layers.core.Activation object at 0x7f25de935ed0> True
<keras.layers.convolutional.Conv2D object at 0x7f25de8b06d0> True
<keras.layers.normalization.BatchNormalization object at 0x7f25de8b0bd0> True
<keras.layers.core.Activation object at 0x7f25de850dd0> True
<keras.layers.pooling.GlobalAveragePooling2D object at 0x7f25de7cad50> True
<keras.layers.core.Dense object at 0x7f25ddd6bfd0> True
<keras.layers.core.Dense object at 0x7f25de74c0d0> True
saved model name:  /home/jimmy/catkin_ws/src/ev_safety_check/models/4labels_AndrewNDatatClassified_dense512.h5
Found 77721 images belonging to 4 classes.
Found 22257 images belonging to 4 classes.
train_label2index =  {'car': 0, 'nopeople': 3, 'manypeople': 2, 'fewpeople': 1}
label2index =  {'car': 0, 'nopeople': 3, 'manypeople': 2, 'fewpeople': 1}
start training time =  2018-08-12 15:55:23.052463
Epoch 1/20
 - 2783s - loss: 0.0099 - acc: 0.9967 - val_loss: 8.1408e-05 - val_acc: 1.0000
Epoch 2/20
 - 2738s - loss: 0.0014 - acc: 0.9996 - val_loss: 2.7125e-06 - val_acc: 1.0000
Epoch 3/20
 - 2722s - loss: 0.0042 - acc: 0.9996 - val_loss: 6.7081e-05 - val_acc: 1.0000
Epoch 4/20
 - 2724s - loss: 0.0020 - acc: 0.9997 - val_loss: 1.4030e-07 - val_acc: 1.0000
Epoch 5/20
 - 2724s - loss: 1.3446e-04 - acc: 1.0000 - val_loss: 1.2040e-07 - val_acc: 1.0000
Epoch 6/20
 - 2724s - loss: 0.0014 - acc: 0.9997 - val_loss: 1.1975e-07 - val_acc: 1.0000
Epoch 7/20
 - 2722s - loss: 1.2163e-04 - acc: 1.0000 - val_loss: 1.2213e-07 - val_acc: 1.0000
Epoch 8/20
 - 2723s - loss: 2.2347e-05 - acc: 1.0000 - val_loss: 1.2644e-07 - val_acc: 1.0000
Epoch 9/20
 - 2724s - loss: 4.5892e-05 - acc: 1.0000 - val_loss: 1.1939e-07 - val_acc: 1.0000
Epoch 10/20
 - 2724s - loss: 8.7107e-06 - acc: 1.0000 - val_loss: 1.0954e-06 - val_acc: 1.0000
Epoch 11/20
 - 2724s - loss: 2.0943e-04 - acc: 0.9997 - val_loss: 3.1732e-07 - val_acc: 1.0000
Epoch 12/20
 - 2722s - loss: 1.2569e-04 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 13/20
 - 2724s - loss: 5.6492e-07 - acc: 1.0000 - val_loss: 1.1923e-07 - val_acc: 1.0000
Epoch 14/20
 - 2723s - loss: 3.2790e-05 - acc: 1.0000 - val_loss: 6.9156e-04 - val_acc: 1.0000
Epoch 15/20
 - 2723s - loss: 7.8100e-04 - acc: 0.9997 - val_loss: 1.3962e-04 - val_acc: 1.0000
Epoch 16/20
 - 2723s - loss: 0.0019 - acc: 0.9997 - val_loss: 3.6252e-04 - val_acc: 1.0000
Epoch 17/20
 - 2725s - loss: 8.3102e-04 - acc: 0.9997 - val_loss: 1.9365e-04 - val_acc: 1.0000
Epoch 18/20
 - 2723s - loss: 1.6623e-07 - acc: 1.0000 - val_loss: 3.8275e-04 - val_acc: 1.0000
Epoch 19/20
 - 2723s - loss: 7.8292e-05 - acc: 1.0000 - val_loss: 1.1921e-07 - val_acc: 1.0000
Epoch 20/20
 - 2724s - loss: 1.2556e-06 - acc: 1.0000 - val_loss: 2.7706e-04 - val_acc: 1.0000
end training time =  2018-08-13 07:04:29.983521
Found 22257 images belonging to 4 classes.
No of errors = 1/22257
